#### ConduitSize Members

---

|  |
| --- |
| ConduitSize Class   Constructors   Methods   Properties   See Also |

The  ConduitSize  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ConduitSize | Constructs an object that stores the basic size information for conduit. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ConduitSize |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BendRadius | Minimum bend radius |
| Public property | InnerDiameter | Inner diameter |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | NominalDiameter | Nominal diameter |
| Public property | OuterDiameter | Outer diameter |
| Public property | UsedInSizeLists | Whether it is used in size lists. |
| Public property | UsedInSizing | Whether is used in sizing. |

# See Also

ConduitSize Class

Autodesk.Revit.DB.Electrical Namespace